import { Box, Container, Grid } from '@mui/material'
import React from 'react'
import Bg from '../assets/QuestionBg.jpeg'



export default function CommonQuestions() {
    return (
        <>
            <Grid>
                <Container>
                    <Grid container>
                        <Box
                            sx={{
                                width: "100%",
                                boxSizing: "border-box",
                                backgroundImage: `url(${Bg})`,
                                backgroundRepeat: "no-repeat",
                                backgroundSize: "cover",
                                backgroundPosition: "center",
                                borderRadius: "26px",
                                padding: "3rem",
                                overflow: "hidden",
                                position: "relative",
                                zIndex: "1",
                                marginBottom: "2rem",
                                "&::after": {
                                    content: "' '",
                                    position: "absolute",
                                    top: "0",
                                    right: "0",
                                    left: "0",
                                    bottom: "0",
                                    background: "rgba(0, 0, 0, 0.5)",
                                    zIndex: "2",
                                },
                            }}
                        >
                            <Grid
                                sx={{
                                    display: "flex",
                                    flexDirection: "column",
                                    justifyContent: "center",
                                    alignItems: "center",
                                    zIndex: "3",
                                    position: "relative",
                                }}>
                                <Box sx={{
                                    fontFamily: "Almarai",
                                    fontSize: "64px",
                                    fontWeight: "800",
                                    lineHeight: "71.42px",
                                    textAlign: "center",
                                    color: "#FFFFFF",
                                    margin: "2rem 0"
                                }}>الأسلئلة الشائعة</Box>
                                <Box sx={{
                                    fontFamily: "Almarai",
                                    fontSize: "20px",
                                    fontWeight: "700",
                                    lineHeight: "30px",
                                    textAlign: "center",
                                    color: "#FFFFFF",
                                    margin: "2rem 0"
                                }}>يمكنك الإطلاع على أكثر الأسئلة الشائعة حول خدمات<br>
                                    </br> منصة المصدر الدولي للإستقدام</Box>

                                <Grid
                                    sx={{
                                        width: "200px",
                                        height: "59px",
                                        border: "2px solid #FFFFFF",
                                        borderRadius: "10px",
                                        display: "flex",
                                        alignItems: "center",
                                        justifyContent: "center",
                                        color: "#FFFFFF",
                                        margin: "2rem 0"

                                    }}
                                >هل تحتاج إلى مساعدة؟</Grid>

                                <Grid sx={{
                                    display: "flex",

                                }}>
                                    <LogoBtn logo={
                                        <svg xmlns="http://www.w3.org/2000/svg" width="8" height="16" viewBox="0 0 8 16" fill="none">
                                            <g clip-path="url(#clip0_1_44315)">
                                                <path d="M2.19714 15.1667V8.60677H0V6H2.19714V3.94609C2.19714 1.71458 3.56068 0.5 5.55156 0.5C6.50547 0.5 7.32474 0.571615 7.5625 0.603125V2.9349H6.18177C5.09896 2.9349 4.88984 3.45052 4.88984 4.20391V6H7.33333L6.99818 8.60677H4.88984V15.1667" fill="white" />
                                            </g>
                                            <defs>
                                                <clipPath id="clip0_1_44315">
                                                    <rect width="8" height="15" fill="white" transform="translate(0 0.5)" />
                                                </clipPath>
                                            </defs>
                                        </svg>
                                    } />
                                    <LogoBtn logo={<svg xmlns="http://www.w3.org/2000/svg" width="17" height="12" viewBox="0 0 17 12" fill="none">
                                        <path d="M16.5255 2.0625C16.3683 1.23779 15.6195 0.637207 14.7506 0.449707C13.4502 0.1875 11.0437 0 8.43991 0C5.83768 0 3.39261 0.1875 2.09072 0.449707C1.22331 0.637207 0.472993 1.19971 0.315842 2.0625C0.157151 3 0 4.3125 0 6C0 7.6875 0.157151 9 0.354359 9.9375C0.51305 10.7622 1.26183 11.3628 2.12924 11.5503C3.5097 11.8125 5.8762 12 8.47997 12C11.0837 12 13.4502 11.8125 14.8307 11.5503C15.6981 11.3628 16.4469 10.8003 16.6056 9.9375C16.7627 9 16.9599 7.64941 17 6C16.9199 4.3125 16.7227 3 16.5255 2.0625ZM6.31068 8.625V3.375L11.1223 6L6.31068 8.625Z" fill="white" />
                                    </svg>} />
                                    <LogoBtn logo={<svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16" fill="none">
                                        <g clip-path="url(#clip0_1_44343)">
                                            <path d="M11.7501 0.5C13.8124 0.5 15.5001 2.1877 15.5001 4.25004V11.7505C15.5001 13.8123 13.8124 15.5005 11.7501 15.5005H4.25004C2.1877 15.5005 0.5 13.8123 0.5 11.7505V4.25004C0.5 2.1877 2.1877 0.5 4.25004 0.5H11.7501ZM11.7501 1.75007H4.25004C2.87171 1.75007 1.75007 2.87152 1.75007 4.25004V11.7505C1.75007 13.1286 2.87171 14.2504 4.25004 14.2504H11.7501C13.129 14.2504 14.2501 13.1286 14.2501 11.7505V4.25004C14.2501 2.87152 13.129 1.75007 11.7501 1.75007ZM8.00007 4.25004C10.071 4.25004 11.7501 5.92874 11.7501 8.00007C11.7501 10.0707 10.071 11.7505 8.00007 11.7505C5.92855 11.7505 4.25004 10.0707 4.25004 8.00007C4.25004 5.92874 5.92855 4.25004 8.00007 4.25004ZM8.00007 5.50011C6.61949 5.50011 5.50011 6.61912 5.50011 8.00007C5.50011 9.38102 6.61949 10.5004 8.00007 10.5004C9.38064 10.5004 10.5 9.38102 10.5 8.00007C10.5 6.61912 9.38064 5.50011 8.00007 5.50011ZM12.0627 2.99996C12.5804 2.99996 13.0002 3.4197 13.0002 3.93746C13.0002 4.45524 12.5804 4.87498 12.0627 4.87498C11.5449 4.87498 11.1252 4.45524 11.1252 3.93746C11.1252 3.4197 11.5449 2.99996 12.0627 2.99996Z" fill="white" />
                                        </g>
                                        <defs>
                                            <clipPath id="clip0_1_44343">
                                                <rect width="15" height="15" fill="white" transform="translate(0.5 0.5)" />
                                            </clipPath>
                                        </defs>
                                    </svg>} />
                                    <LogoBtn logo={<svg xmlns="http://www.w3.org/2000/svg" width="14" height="14" viewBox="0 0 14 14" fill="none">
                                        <g clip-path="url(#clip0_1_44334)">
                                            <path d="M3.40939 13.4951H0.714651V4.81913H3.40939V13.4951ZM2.06057 3.63564C1.19907 3.63564 0.5 2.92208 0.5 2.06057C0.5 1.19907 1.19907 0.5 2.06057 0.5C2.92208 0.5 3.62114 1.19907 3.62114 2.06057C3.62114 2.92208 2.92208 3.63564 2.06057 3.63564ZM13.4951 13.4951H10.8062V9.27169C10.8062 8.26515 10.7858 6.97434 9.40512 6.97434C8.00408 6.97434 7.78943 8.0679 7.78943 9.19917V13.4951H5.09759V4.81913H7.68211V6.00261H7.71982C8.0795 5.32095 8.95841 4.60158 10.2695 4.60158C12.9962 4.60158 13.498 6.3971 13.498 8.72926V13.4951H13.4951Z" fill="white" />
                                        </g>
                                        <defs>
                                            <clipPath id="clip0_1_44334">
                                                <rect width="13" height="13" fill="white" transform="translate(0.5 0.5)" />
                                            </clipPath>
                                        </defs>
                                    </svg>} />
                                    <LogoBtn logo={
                                        <svg xmlns="http://www.w3.org/2000/svg" width="12" height="16" viewBox="0 0 12 16" fill="none">
                                            <g clip-path="url(#clip0_1_44326)">
                                                <path d="M6.25414 0.5C3.24816 0.5 0.277344 2.50398 0.277344 5.74728C0.277344 7.80986 1.43755 8.98178 2.1407 8.98178C2.43075 8.98178 2.59775 8.17315 2.59775 7.94463C2.59775 7.67216 1.90338 7.09206 1.90338 5.95822C1.90338 3.60266 3.69642 1.93267 6.01683 1.93267C8.01202 1.93267 9.48864 3.06651 9.48864 5.1496C9.48864 6.70532 8.8646 9.62341 6.84303 9.62341C6.11351 9.62341 5.48946 9.09604 5.48946 8.34015C5.48946 7.23269 6.26293 6.16038 6.26293 5.01776C6.26293 3.07823 3.51185 3.4298 3.51185 5.77364C3.51185 6.26585 3.57337 6.81079 3.79311 7.25905C3.38879 8.99936 2.56259 11.5922 2.56259 13.3853C2.56259 13.939 2.64169 14.4839 2.69443 15.0377C2.79404 15.149 2.74424 15.1373 2.89659 15.0816C4.37321 13.0601 4.32047 12.6645 4.98847 10.0189C5.34883 10.7045 6.28051 11.0737 7.01882 11.0737C10.1303 11.0737 11.5278 8.04131 11.5278 5.30781C11.5278 2.39851 9.01402 0.5 6.25414 0.5Z" fill="white" />
                                            </g>
                                            <defs>
                                                <clipPath id="clip0_1_44326">
                                                    <rect width="11.4553" height="14.98" fill="white" transform="translate(0.277344 0.5)" />
                                                </clipPath>
                                            </defs>
                                        </svg>} />
                                </Grid>
                            </Grid>
                        </Box>


                        <Grid sx={{
                            fontFamily: "Almarai",
                            fontSize: "48px",
                            fontWeight: "700",
                            lineHeight: "53.57px",
                            textAlign: "right",
                            color: "rgba(0, 82, 136, 1)",
                            margin: "2rem 0"
                        }}>الأسئلة الشائعة </Grid>
                    </Grid>

                <QuestionAndAnswer/>
                <QuestionAndAnswer/>
                <QuestionAndAnswer/>
                <QuestionAndAnswer/>

                </Container >
            </Grid >
        </>
    )
}


function LogoBtn({ logo }) {
    return (
        <>
            <Box sx={{
                width: "40px",
                height: "40px",
                borderRadius: "20px",
                background: "rgba(255, 255, 255, 0.2)",
                display: "flex",
                alignContent: "space-around",
                flexWrap: "warp",
                justifyContent: "center",
                alignItems: "center",
                margin: "0.5rem"


            }}>
                {logo}
            </Box>
        </>
    )
}

function QuestionAndAnswer() {

    return (
        <>
            <Grid container sx={{

                display: "flex",
                justifyContent: "space-evenly",
                alignItems: "center",
                margin: "2rem 0rem" 

            }}>

                <Grid item xs={1.5}>
                    <Box sx={{
                        display: "flex",
                        borderLeft: "3px solid rgba(0, 82, 136, 1)",
                        width: "87px",
                        height: "105px",
                        alignItems: "center",
                        justifyContent: "center"
                    }}>
                        <svg xmlns="http://www.w3.org/2000/svg" width="69" height="61" viewBox="0 0 69 61" fill="none">
                            <path d="M39.368 60.5001C55.7298 60.5001 68.9937 47.2362 68.9937 30.8743C68.9937 14.5124 55.7298 1.24854 39.368 1.24854C23.0061 1.24854 9.74219 14.5124 9.74219 30.8743C9.74219 47.2362 23.0061 60.5001 39.368 60.5001Z" fill="#71C2FF" />
                            <path d="M64.7477 30.1258C64.7477 45.3831 52.3792 57.7516 37.1219 57.7516C21.8646 57.7516 9.49609 45.3831 9.49609 30.1258C9.49609 14.8685 21.8646 2.5 37.1219 2.5C52.3792 2.5 64.7477 14.8685 64.7477 30.1258Z" fill="white" stroke="#005288" stroke-width="4" />
                            <path d="M53.4175 30.126C55.8718 30.126 57.8614 28.1364 57.8614 25.6821C57.8614 23.2279 55.8718 21.2383 53.4175 21.2383C50.9632 21.2383 48.9736 23.2279 48.9736 25.6821C48.9736 28.1364 50.9632 30.126 53.4175 30.126Z" fill="#005288" />
                            <path d="M32.6792 30.126C35.1335 30.126 37.1231 28.1364 37.1231 25.6821C37.1231 23.2279 35.1335 21.2383 32.6792 21.2383C30.2249 21.2383 28.2354 23.2279 28.2354 25.6821C28.2354 28.1364 30.2249 30.126 32.6792 30.126Z" fill="#005288" />
                            <path d="M37.1259 44.9391C36.1719 44.9391 35.2328 44.4799 34.664 43.6296C33.7515 42.2728 34.1129 40.43 35.4698 39.5176C40.7995 35.9388 50.8604 36.0424 51.9921 36.0513C53.6274 36.0839 54.925 37.4349 54.8924 39.0702C54.8658 40.6848 53.5445 41.9765 51.9358 41.9765C51.7669 41.9795 51.6218 41.9735 51.4381 41.9735C48.5614 41.9735 41.8127 42.3972 38.776 44.4384C38.2694 44.7761 37.6917 44.9391 37.1259 44.9391Z" fill="#005288" />
                            <path d="M6.22778 18.8029L6.2274 18.8051C5.83464 21.0822 7.5873 23.1498 9.86281 23.1967C8.66229 23.2481 7.61449 23.7216 6.81787 24.6383L6.81611 24.6403C6.02629 25.5532 5.62262 26.6478 5.62262 27.8757C5.62262 29.1147 6.02083 30.2252 6.83249 31.1266L6.83438 31.1287C7.6824 32.0662 8.80724 32.5208 10.0841 32.5208C11.3592 32.5208 12.4822 32.0655 13.3316 31.131L13.3317 31.131L13.3375 31.1245C14.1482 30.2201 14.5425 29.1134 14.5425 27.8757C14.5425 26.6534 14.1483 25.556 13.35 24.638L13.3482 24.6359C12.5163 23.6835 11.4124 23.2093 10.1534 23.1925C11.9227 23.1012 13.2147 21.7852 13.629 20.2386L13.6291 20.2382C13.7755 19.6906 14.0635 19.2459 14.4936 18.7751C14.714 18.5339 14.9614 18.2967 15.2453 18.0309C15.2919 17.9873 15.3397 17.9427 15.3885 17.8972C15.6271 17.6747 15.8891 17.4303 16.1443 17.174C16.7715 16.5442 17.4266 15.7768 17.9152 14.7409C18.4066 13.6994 18.699 12.4525 18.699 10.8912C18.699 9.59712 18.4702 7.46476 17.26 5.61929C15.9915 3.68495 13.76 2.24365 10.1611 2.24365C7.93178 2.24365 6.17959 2.87497 4.83562 3.86244C3.50606 4.83934 2.64307 6.11458 2.09046 7.31357L2.09015 7.31426C1.03498 9.6073 2.57495 12.1518 4.92525 12.5666L4.92583 12.5667C6.45427 12.8357 8.15666 12.1652 8.92022 10.6428L7.8029 10.0824L8.91904 10.6452C9.04418 10.397 9.18329 10.2207 9.32264 10.1123C9.44294 10.0188 9.5909 9.95187 9.82335 9.95187C10.1067 9.95187 10.2377 10.0152 10.2932 10.0505C10.3518 10.0877 10.4112 10.1482 10.469 10.2631C10.6066 10.5366 10.6472 10.9356 10.6472 11.303C10.6472 12.1033 10.2523 12.4888 9.18589 13.5301C9.16068 13.5547 9.13509 13.5797 9.10911 13.6051C8.02711 14.6621 6.69992 16.0941 6.22778 18.8029Z" fill="#005288" stroke="white" stroke-width="2.5" />
                        </svg>
                    </Box>
                </Grid>
                <Grid item xs={10.5}>
                    <Box sx={{

                        color: "rgba(0, 82, 136, 1)",
                        background: "rgba(218, 234, 244, 1)",
                        borderRadius: "11px",
                        fontSize: "20px",
                        fontWeight: "700",
                        padding: "1rem 1.4rem",
                        justifyContent: "center",
                        marginBottom:"1rem"
                    }}>
                        هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
                    </Box>
                </Grid>
                <Grid
                sx={{
                    fontSize: "20px",
                    fontWeight: "700",
                    textAlign: "justified",
                    lineHeight: "34.43px"
                }}

            >هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص.هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص.</Grid>

            </Grid>
            
        </>
    )
}